Revit 2017 API
RebarConstraint.GetTargetHostFaceReference Method
 Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public Reference GetTargetHostFaceReference()
Visual Basic
Public Function GetTargetHostFaceReference As Reference
Visual C++
public:
Reference^ GetTargetHostFaceReference()
Return Value
 Requested reference.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace